export default function Home() {
  return (
    <main>
      <div>I am Link.</div>
      <div>Jan 30 2026</div>
      <p>
        创建了logo, 使用svg 并没有学习svg具体代码的知识, 只是有大概的了解,
        然后去问AI如何写, 然后一点点理解代码, 从做项目的角度去学习,
        而不是从学习知识的角度, 效果很好, 效率高 并且回报快, 精准的学习,
        很有成就感, 一下午就做出来了, 比看教程好太多了,
        为什么不早点开始这样子做呢?
      </p>
      <div>Feb 5 2026</div>
      <p>
        上学时需要为了最后考试备考, 需要整本书所有知识全部理解, 记忆,
        但是创业写代码完全不同, 只少量知识就能实现基本功能, 并且也能查,
        最重要的是, 上学学的内容, 都是几十年不变的, 代码很容易就会变,
        记如何实现的语法完全没意义, 如何实现功能, 怎么应用, 都不重要,
        那什么最重要呢, 精准提问的能力, 准确描述自己的问题,
        不需要知道知识如何解决, 只要精准描述了问题就可以了, switch 视频拼接在
        Final Cut Pro 中直接大小翻一倍, 这个问题描述给AI 就学到码率知识,
        什么软件能解决, 并给出代码如何解决, 如何自动化处理, 代码一点没看,
        但是解决问题了, 实现软件的功能也是如此, 给出的内容太多理解不了怎么办,
        从零开始一点点构建, 尝试 专注每一个功能, 顺便再去理解为什么是可行的,
        原理, 这样的学习方式对创业做项目来说 真的太棒啦, 为啥毕业一年半才明白呢,
        早点明白就好了, 要是早点就不上学就好了, 不用花这么大力量扭转思维习惯
      </p>
    </main>
  );
}
